MikroElektronika/core_packages/ARM/gcc_clang/startup/nxp/mk80fn256vdc15.s
    .weak      Reserved83_IRQHandler
    .thumb_set Reserved83_IRQHandler,Default_Handler

    .weak      Reserved84_IRQHandler
    .thumb_set Reserved84_IRQHandler,Default_Handler

    .weak      Reserved85_IRQHandler
    .thumb_set Reserved85_IRQHandler,Default_Handler

    .weak      FLEXIO0_IRQHandler
    .thumb_set FLEXIO0_IRQHandler,Default_Handler

    .weak      FTM3_IRQHandler
    .thumb_set FTM3_IRQHandler,Default_Handler

    .weak      Reserved88_IRQHandler
    .thumb_set Reserved88_IRQHandler,Default_Handler

    .weak      Reserved89_IRQHandler
    .thumb_set Reserved89_IRQHandler,Default_Handler

    .weak      I2C2_IRQHandler
    .thumb_set I2C2_IRQHandler,Default_Handler

    .weak      Reserved91_IRQHandler
    .thumb_set Reserved91_IRQHandler,Default_Handler

    .weak      Reserved92_IRQHandler
    .thumb_set Reserved92_IRQHandler,Default_Handler

    .weak      Reserved93_IRQHandler
    .thumb_set Reserved93_IRQHandler,Default_Handler

    .weak      Reserved94_IRQHandler
    .thumb_set Reserved94_IRQHandler,Default_Handler

    .weak      Reserved95_IRQHandler
    .thumb_set Reserved95_IRQHandler,Default_Handler

    .weak      Reserved96_IRQHandler
    .thumb_set Reserved96_IRQHandler,Default_Handler

    .weak      SDHC_IRQHandler
    .thumb_set SDHC_IRQHandler,Default_Handler

    .weak      Reserved98_IRQHandler
    .thumb_set Reserved98_IRQHandler,Default_Handler

    .weak      Reserved99_IRQHandler
    .thumb_set Reserved99_IRQHandler,Default_Handler

    .weak      Reserved100_IRQHandler
    .thumb_set Reserved100_IRQHandler,Default_Handler

    .weak      Reserved101_IRQHandler
    .thumb_set Reserved101_IRQHandler,Default_Handler

    .weak      Reserved102_IRQHandler
    .thumb_set Reserved102_IRQHandler,Default_Handler

    .weak      TSI0_IRQHandler
    .thumb_set TSI0_IRQHandler,Default_Handler

    .weak      TPM1_IRQHandler
    .thumb_set TPM1_IRQHandler,Default_Handler

    .weak      TPM2_IRQHandler
    .thumb_set TPM2_IRQHandler,Default_Handler

    .weak      Reserved106_IRQHandler
    .thumb_set Reserved106_IRQHandler,Default_Handler

    .weak      I2C3_IRQHandler
    .thumb_set I2C3_IRQHandler,Default_Handler

    .weak      Reserved108_IRQHandler
    .thumb_set Reserved108_IRQHandler,Default_Handler

    .weak      Reserved109_IRQHandler
    .thumb_set Reserved109_IRQHandler,Default_Handler

    .weak      Reserved110_IRQHandler
    .thumb_set Reserved110_IRQHandler,Default_Handler

    .weak      Reserved111_IRQHandler
    .thumb_set Reserved111_IRQHandler,Default_Handler

    .weak      Reserved112_IRQHandler
    .thumb_set Reserved112_IRQHandler,Default_Handler

    .weak      Reserved113_IRQHandler
    .thumb_set Reserved113_IRQHandler,Default_Handler

    .weak      Reserved114_IRQHandler
    .thumb_set Reserved114_IRQHandler,Default_Handler

    .weak      Reserved115_IRQHandler
    .thumb_set Reserved115_IRQHandler,Default_Handler

    .weak      QuadSPI0_IRQHandler
    .thumb_set QuadSPI0_IRQHandler,Default_Handler

    .weak      Reserved117_IRQHandler
    .thumb_set Reserved117_IRQHandler,Default_Handler

    .weak      Reserved118_IRQHandler
    .thumb_set Reserved118_IRQHandler,Default_Handler

    .weak      Reserved119_IRQHandler
    .thumb_set Reserved119_IRQHandler,Default_Handler

    .weak      Reserved120_IRQHandler
    .thumb_set Reserved120_IRQHandler,Default_Handler

    .weak      Reserved121_IRQHandler
    .thumb_set Reserved121_IRQHandler,Default_Handler

    .weak      Reserved122_IRQHandler
    .thumb_set Reserved122_IRQHandler,Default_Handler
